DataProcessors/лб_ОбменСПлатежнымиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>лб_ОбменСПлатежнымиСистемами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПапкаСФайлами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕстьОшибки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплатыПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленоПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияСчетчика1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияСчетчика2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРеестра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реестры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/лб_ДопСведенияОбОплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ДопСведенияОбОплате</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонКвитанции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийОплатыКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийОплатыКУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКассовойСмены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ШаблоныИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныИзвещений</Name>
			<Comment>Шаблоны извещений</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сальдо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредит</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцедураПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/лб_ОбменСПлатежнымиСистемами/Forms/Форма/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СтраницыРезультат.Видимость = Ложь;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗагруженныеДокументы, "Ссылка", СписокДокументовОтбор.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтоКлиент = Истина;
	ИзменитьРежимОбработки(ЭтоКлиент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементоФормы

&НаКлиенте
Процедура ГиперссылкаОшибкиНажатие(Элемент)
	
	ПодготовитьОтчетОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОшибкиПриИзменении(Элемент)
	
	Если Элементы.Данные.ОтборСтрок = Неопределено Тогда
		ОтборСтрок = Новый Структура;
	Иначе
		ОтборСтрок = Новый Структура(Элементы.Данные.ОтборСтрок);
	КонецЕсли;

	Если ТолькоОшибки Тогда
		ОтборСтрок.Вставить("ЕстьОшибки", Истина);
		Элементы.Данные.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	Иначе
		Элементы.Данные.ОтборСтрок = Неопределено;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаКлиенте(Команда)
	
	Если Не ЭтоКлиент Тогда
		
		ЭтоКлиент = Истина;
		
		ИзменитьРежимОбработки(ЭтоКлиент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаСервере(Команда)
	
	Если ЭтоКлиент Тогда
		
		ЭтоКлиент = Ложь;
		
		ИзменитьРежимОбработки(ЭтоКлиент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Объект.Данные.Очистить();
	Объект.Документы.Очистить();
	Объект.Реестры.Очистить();
	ТаблицаОшибок.Очистить();
	СписокДокументовОтбор.Очистить();
	
	Элементы.СтраницыРезультат.Видимость = Ложь;
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДанные;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗагруженныеДокументы, "Ссылка", СписокДокументовОтбор.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке);

	ВыполнитьЗагрузкуИзФормы();

КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Объект.Данные.Очистить();
	Объект.Документы.Очистить();
	Объект.Реестры.Очистить();
	ТаблицаОшибок.Очистить();
	СписокДокументовОтбор.Очистить();
	
	УстановитьВидимостьСтраницыРезультат();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗагруженныеДокументы, "Ссылка", СписокДокументовОтбор.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗагруженныхДанных(Команда)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ОтчетЗагруженныхДанныхНаСервере(ДокументРезультат);
	
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	
	ДокументРезультат.Показать(НСтр("ru = 'Загруженные данные'"));

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыНаСервере();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДокументы;
	
	Если Не ПустаяСтрока(Каталог) Тогда
		Если ЭтоКлиент Тогда
			УдалитьФайлы(Каталог, "*.dbf");
		Иначе
			УдалитьФайлыНаСервере(Каталог);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьРасположениеФайла()
	Элементы.ПапкаСФайлами.Видимость = Не ЭтоКлиент;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРежимОбработки(РежимРаботы)
	
	ГруппаРежима = КоманднаяПанель.ПодчиненныеЭлементы.РежимОбработки.ПодчиненныеЭлементы;
	
	ГруппаРежима.ФормаНаКлиенте.Пометка = РежимРаботы;
	ГруппаРежима.ФормаНаСервере.Пометка = Не РежимРаботы;
	
	КоманднаяПанель.ПодчиненныеЭлементы.РежимОбработки.Заголовок = 
	?(РежимРаботы, НСтр("ru = 'Режим работы (на клиенте)'"), НСтр("ru = 'Режим работы (на сервере)'"));
	

	ИзменитьРасположениеФайла();
	
КонецПроцедуры

#Область Работа_С_Файлами

&НаКлиенте
Процедура ПапкаСФайламиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Заголовок = НСтр("ru = 'Выберите папку для чтения/сохранения файлов обмена на сервере'");
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Каталог = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуИзФормы()
	
	Если ЭтоКлиент Тогда
		
		ДополнительныеПараметры = Новый Структура();
		ОписаниеЗавершения = Новый ОписаниеОповещения("ПрочитатьФайлыИзКаталогаПослеПоискаФайлов", ЭтотОбъект, ДополнительныеПараметры);
		
		ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогВыбораКаталога.Заголовок = НСтр("ru = 'Выберите папку для чтения/сохранения файлов обмена'");
		Если ДиалогВыбораКаталога.Выбрать() Тогда
			Каталог = ДиалогВыбораКаталога.Каталог;
			НачатьПоискФайлов(ОписаниеЗавершения, ДиалогВыбораКаталога.Каталог, "*.dbf");
		КонецЕсли;
		
		Возврат;
	Иначе
		
		Если ПустаяСтрока(Каталог) Тогда
			Предупреждение(НСтр("ru = 'Выберите папку для чтения/сохранения файлов обмена на сервере'"));
			Возврат;
		КонецЕсли;
		
		ВыполнитьЗагрузкуИзКаталогаНаСервере();
		УстановитьВидимостьСтраницыРезультат();

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлыИзКаталогаПослеПоискаФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НайденныеФайлы.Количество() = 0 Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='В каталоге «%1» не найдены файлы для загрузки.'"), Каталог);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ПомещаемыеФайлы = Новый Массив;
	Для Каждого ОписаниеФайла Из НайденныеФайлы Цикл
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ОписаниеФайла.ПолноеИмя));
	КонецЦикла;

	Обработчик = Новый ОписаниеОповещения("ПрочитатьФайлыИзКаталогаПослеПомещенияФайлов", ЭтотОбъект, ДополнительныеПараметры);
	
	Попытка
		НачатьПомещениеФайлов(Обработчик, ПомещаемыеФайлы, , Ложь, УникальныйИдентификатор);
	Исключение
		ТекстСообщения = НСтр("ru = 'При помещении файлов во временное хранилище произошла ошибка'")
			+ ":" + Символы.ПС + ОписаниеОшибки();
		ЗафиксироватьОшибку(ЭтотОбъект, ТекстСообщения);
		
	КонецПопытки;

	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлыИзКаталогаПослеПомещенияФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		РезультатЗагрузки = Ложь;
	Иначе
		РезультатЗагрузки = Истина;
	КонецЕсли;
	
	Если РезультатЗагрузки Тогда 
		ЗапуститьЗагрузкуНаСервере(ПомещенныеФайлы);
	КонецЕсли;
	
	УстановитьВидимостьСтраницыРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьЗагрузкуНаСервере(ОписаниеФайловЗагрузки)
	
	ОписаниеФайлов = Новый Массив;
	Для Каждого Описание Из ОписаниеФайловЗагрузки Цикл
		ДанныеФайла = Новый Структура("Имя, ВремяИзменения");
		ЗаполнитьЗначенияСвойств(ДанныеФайла, Описание);
		ДанныеФайла.Вставить("Хранение", ПолучитьИзВременногоХранилища(Описание.Хранение));
		ОписаниеФайлов.Добавить(ДанныеФайла);
	КонецЦикла;
	
	КаталогФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути( ПолучитьИмяВременногоФайла() );
	СоздатьКаталог(КаталогФайлов);

	Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
		Файл = Новый Файл(ОписаниеФайла.Имя);
		ПолноеИмяФайла = КаталогФайлов + ВРег(Файл.Имя);
		
		Если ВРег(Прав(ПолноеИмяФайла, 4)) <> ".DBF" Тогда
			Продолжить;
		КонецЕсли;

		Данные = ОписаниеФайла.Хранение;
		ТипДанных = ТипЗнч(Данные);
		
		Если ТипДанных = Тип("ДвоичныеДанные") Тогда
			Данные.Записать(ПолноеИмяФайла);
		ИначеЕсли ЭтоАдресВременногоХранилища(Данные) Тогда
			Данные = ПолучитьИзВременногоХранилища(Данные);
			Данные.Записать(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	тзОшибки = ОбработкаОбъект.ЗагрузитьДанныеИзКаталога(КаталогФайлов, Объект.НаправлениеОбмена, Объект.ДатаЗагрузки);

	ДобавитьОшибкиЗагрузкиВТаблицуОшибок(тзОшибки);
	
	Попытка
		УдалитьФайлы(КаталогФайлов)
	Исключение
		ЗаписьЖурналаРегистрации("Обмен с платежными системами (Омск)", УровеньЖурналаРегистрации.Предупреждение,
			,, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
			|%1 по причине: %2'"), КаталогФайлов, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки

КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуИзКаталогаНаСервере()
	
	КаталогФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Каталог);

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	тзОшибки = ОбработкаОбъект.ЗагрузитьДанныеИзКаталога(КаталогФайлов, Объект.НаправлениеОбмена, Объект.ДатаЗагрузки);
	
	ДобавитьОшибкиЗагрузкиВТаблицуОшибок(тзОшибки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗафиксироватьОшибку(Форма, ТекстОшибки, ТекстРекомендации = "")
	
	НоваяОшибка = Форма.ТаблицаОшибок.Добавить();
	НоваяОшибка.Ошибка       = ТекстОшибки;
	НоваяОшибка.Рекомендации = ТекстРекомендации;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОшибкиЗагрузкиВТаблицуОшибок(тзОшибки)
	
	Для Каждого Ошибка Из тзОшибки Цикл
		НоваяСтрока = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ошибка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьФайлыНаСервере(Каталог)
	 УдалитьФайлы(Каталог, "*.dbf");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьВидимостьСтраницыРезультат()
	
	ЕстьОшибки = ТаблицаОшибок.Количество() > 0;
	
	Элементы.СтраницыРезультат.Видимость = Истина;

	Если Не ЕстьОшибки Тогда
		Элементы.СтраницыРезультат.ТекущаяСтраница = Элементы.Успех;
	Иначе
		Элементы.СтраницыРезультат.ТекущаяСтраница = Элементы.Ошибки;
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			Элементы.ГиперссылкаОшибки.Видимость = Истина;
			Элементы.ГиперссылкаОшибки.Заголовок = НСтр("ru = 'Список ошибок'")
			+ " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '(сообщений: %1)'"), ТаблицаОшибок.Количество());
		Иначе
			Элементы.ГиперссылкаОшибки.Видимость = Ложь;
			Элементы.ГиперссылкаОшибки.Заголовок = НСтр("ru = 'Список ошибок'");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьОтчетОбОшибках()
	
	ОтчетОбОшибках = Новый ТабличныйДокумент;
	ПодготовитьОтчетОбОшибкахСервер(ОтчетОбОшибках);
	
	ОтчетОбОшибках.ТолькоПросмотр      = Истина;
	ОтчетОбОшибках.ОтображатьЗаголовки = Ложь;
	ОтчетОбОшибках.ОтображатьСетку     = Ложь;
	
	ОтчетОбОшибках.Показать(НСтр("ru = 'Список ошибок'"));
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьОтчетОбОшибкахСервер(ОтчетОбОшибках)
	
	Макет = Обработки.лб_ОбменСПлатежнымиСистемами.ПолучитьМакет("СписокОшибок");

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОтчетОбОшибках.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Для Каждого СтрокаОшибок Из ТаблицаОшибок Цикл
		ОбластьМакета.Параметры.Заполнить(СтрокаОшибок);
		ОтчетОбОшибках.Вывести(ОбластьМакета);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтчетЗагруженныхДанныхНаСервере(ДокументРезультат)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СКД = ОбработкаОбъект.ПолучитьМакет("СКД_ЗагруженныеДанные");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, СКД.НастройкиПоУмолчанию,,, Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаДанных", ТаблицаДанныхДляОтчета());
	
	// Создадим и инициализируем процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

КонецПроцедуры

&НаСервере
Функция ТаблицаДанныхДляОтчета()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", Объект.Данные.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаДанных.ДатаОплаты КАК ДатаОплаты,
		|	ТаблицаДанных.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаДанных.Услуга КАК Услуга,
		|	ТаблицаДанных.СуммаОплаты КАК СуммаОплаты,
		|	ТаблицаДанных.СуммаКомиссии КАК СуммаКомиссии,
		|	ТаблицаДанных.СуммаНачислено КАК СуммаНачислено,
		|	ТаблицаДанных.СуммаОплатыПени КАК СуммаОплатыПени,
		|	ТаблицаДанных.СуммаНачисленоПени КАК СуммаНачисленоПени,
		|	ТаблицаДанных.Сальдо КАК Сальдо,
		|	ТаблицаДанных.СальдоПени КАК СальдоПени
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТДанные.ДатаОплаты КАК ДатаОплаты,
		|	ВТДанные.ПериодНачисления КАК ПериодНачисления,
		|	ВТДанные.Услуга КАК Услуга,
		|	ВТДанные.СуммаОплаты КАК СуммаОплаты,
		|	ВТДанные.СуммаКомиссии КАК СуммаКомиссии,
		|	ВТДанные.СуммаНачислено КАК СуммаНачислено,
		|	ВТДанные.СуммаОплатыПени КАК СуммаОплатыПени,
		|	ВТДанные.СуммаНачисленоПени КАК СуммаНачисленоПени,
		|	ВТДанные.Сальдо КАК Сальдо,
		|	ВТДанные.СальдоПени КАК СальдоПени,
		|	ВЫБОР
		|		КОГДА ВТДанные.ЛицевойСчет ССЫЛКА Справочник.бит_ЛицевыеСчета
		|				И ВТДанные.Услуга ССЫЛКА Справочник.бит_УслугиЖКХ
		|			ТОГДА ""Загружено без ошибок""
		|		ИНАЧЕ ""Загружено с ошибками""
		|	КОНЕЦ КАК РезультатЗагрузки,
		|	ВЫБОР
		|		КОГДА ВТДанные.ЛицевойСчет ССЫЛКА Справочник.бит_ЛицевыеСчета
		|			ТОГДА ВЫРАЗИТЬ(ВТДанные.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета).Организация
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	КОНЕЦ КАК Организация
		|ИЗ
		|	ВТДанные КАК ВТДанные";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#Область СозданиеДокументов

&НаСервере
Функция РезультатЗапросаДляЗаполненияДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", Объект.Данные.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаРеестры", Объект.Реестры.Выгрузить());

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРеестры.ИмяФайлаРеестра КАК ИмяФайлаРеестра,
		|	ТаблицаРеестры.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТРеестр
		|ИЗ
		|	&ТаблицаРеестры КАК ТаблицаРеестры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаДанных.ДатаОплаты КАК ДатаОплаты,
		|	ТаблицаДанных.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаДанных.Услуга КАК Услуга,
		|	ТаблицаДанных.СуммаОплаты КАК СуммаОплаты,
		|	ТаблицаДанных.СуммаКомиссии КАК СуммаКомиссии,
		|	ТаблицаДанных.СуммаНачислено КАК СуммаНачислено,
		|	ТаблицаДанных.СуммаОплатыПени КАК СуммаОплатыПени,
		|	ТаблицаДанных.СуммаНачисленоПени КАК СуммаНачисленоПени,
		|	ТаблицаДанных.Сальдо КАК Сальдо,
		|	ТаблицаДанных.СальдоПени КАК СальдоПени,
		|	ТаблицаДанных.ИдентификаторСтрокиРеестра КАК ИдентификаторСтрокиРеестра
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТДанные.ПериодНачисления КАК ПериодНачисления,
		|	ВТДанные.ДатаОплаты КАК ДатаОплаты,
		|	СУММА(ВТДанные.СуммаОплаты) КАК Сумма
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДанные.ЛицевойСчет,
		|	ВТДанные.ДатаОплаты,
		|	ВТДанные.ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТДанные.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета).Организация КАК Организация,
		|	ВТДанные.ДатаОплаты КАК ДатаОплаты,
		|	ВТДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТДанные.Услуга КАК Услуга,
		|	ВТДанные.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(ВТДанные.СуммаОплаты) КАК Сумма,
		|	СУММА(ВТДанные.СуммаКомиссии) КАК СуммаКомиссии,
		|	СУММА(ВТДанные.СуммаОплатыПени) КАК СуммаПени,
		|	СУММА(ВТДанные.Сальдо) КАК Сальдо,
		|	СУММА(ВТДанные.СальдоПени) КАК СальдоПени,
		|	СУММА(ВТДанные.СуммаНачислено) КАК Начислено
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|ГДЕ
		|	ВТДанные.ЛицевойСчет ССЫЛКА Справочник.бит_ЛицевыеСчета
		|	И ВТДанные.Услуга ССЫЛКА Справочник.бит_УслугиЖКХ
		|	И ВТДанные.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДанные.ЛицевойСчет,
		|	ВТДанные.ДатаОплаты,
		|	ВТДанные.ПериодНачисления,
		|	ВТДанные.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	ДатаОплаты,
		|	ЛицевойСчет,
		|	Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТДанные.ДатаОплаты КАК ДатаОплаты,
		|	ВТРеестр.ИмяФайлаРеестра КАК ИмяФайлаРеестра
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРеестр КАК ВТРеестр
		|		ПО ВТДанные.ИдентификаторСтрокиРеестра = ВТРеестр.ИдентификаторСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДанные.ЛицевойСчет,
		|	ВТРеестр.ИмяФайлаРеестра,
		|	ВТДанные.ДатаОплаты";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	РезультатЗапроса = РезультатЗапросаДляЗаполненияДокументов();
	
	МассивЛС  = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить().ВыгрузитьКолонку("ЛицевойСчет");
	тзРеестры = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	тзСведенияОбОплате = РезультатЗапроса[РезультатЗапроса.ВГраница()-2].Выгрузить();
	
	Выборка = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Организация") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("ДатаОплаты") Цикл
			
			тзСальдоЛС = ТаблицаСальдоПоЛицевымСчетам(Выборка.ДатаОплаты, МассивЛС);
			
			ДокОбъект = Документы.бит_ОплатаКУ.СоздатьДокумент();
			ДокОбъект.Организация  = Выборка.Организация;
			ДокОбъект.Дата         = Выборка.ДатаОплаты;
			ДокОбъект.ВводВРучную  = Истина;
			ДокОбъект.лб_ВидОплаты = Объект.НаправлениеОбмена.лб_ВидОплаты;
			ДокОбъект.ВидОперации  = Перечисления.бит_ВидыОперацийОплатыКУ.НачислениеОплаты;
						
			МассивИменРеестров = Новый Массив;
			Пока Выборка.СледующийПоЗначениюПоля("ЛицевойСчет") Цикл 
				
				Сумма = 0;
				
				Отбор = Новый Структура();
				Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет); 
				Отбор.Вставить("ДатаОплаты", Выборка.ДатаОплаты); 
				СтрокиРеестра = тзРеестры.НайтиСтроки(Отбор);
				
				Для Каждого СтрокаТЗ Из СтрокиРеестра Цикл
					Если МассивИменРеестров.Найти(СтрокаТЗ.ИмяФайлаРеестра) = Неопределено Тогда
						МассивИменРеестров.Добавить(СтрокаТЗ.ИмяФайлаРеестра);
					КонецЕсли;
				КонецЦикла;
								
				//тч СписокЛС
				НоваяСтрокаЛС = ДокОбъект.СписокЛС.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЛС, Выборка);
				НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
				
				СтрокаТаблицыСальдо = тзСальдоЛС.Найти(НоваяСтрокаЛС.ЛицевойСчет, "ЛицевойСчет");
				Если СтрокаТаблицыСальдо <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрокаЛС, СтрокаТаблицыСальдо);
				КонецЕсли;
				
				Пока Выборка.СледующийПоЗначениюПоля("Услуга") Цикл
					//тч СписокУслуг
					НоваяСтрока = ДокОбъект.СписокУслуг.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					
					НоваяСтрока.Приоритет = НоваяСтрока.Услуга.Приоритет;
					НоваяСтрока.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
					
					Сумма = Сумма + НоваяСтрока.Сумма;
				КонецЦикла;
				
				НоваяСтрокаЛС.Сумма = Сумма;
			КонецЦикла;
			
			ДокОбъект.ЗапролнитьСчета();
			ДокОбъект.СписокУслуг.Сортировать("Приоритет Возр");
			ДокОбъект.СуммаДокумента = ДокОбъект.СписокЛС.Итог("Сумма");

			ДокОбъект.Комментарий  = "Загружен из реестров: " + СтрСоединить(МассивИменРеестров, "; ");
			
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			
			СписокДокументовОтбор.Добавить(ДокОбъект.Ссылка);
			
			СведенияОбОплатеДокумента = тзСведенияОбОплате.Скопировать(тзСведенияОбОплате.НайтиСтроки(Новый Структура("ДатаОплаты", Выборка.ДатаОплаты)));
			ДобавитьЗаписиСведенияОбОплатеПоДокументу(ДокОбъект.Ссылка, СведенияОбОплатеДокумента);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗагруженныеДокументы, "Ссылка", СписокДокументовОтбор.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке);

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаСальдоПоЛицевымСчетам(Дата, МассивЛС);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(НачислениеПоУслугам.СуммаОстаток) КАК СальдоНаЛС,
	               |	НачислениеПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
	               |	0 КАК СальдоПениВХ
	               |ПОМЕСТИТЬ ВТСальдоПоЛС
	               |ИЗ
	               |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Момент, ЛицевойСчет В (&МассивЛС)) КАК НачислениеПоУслугам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачислениеПоУслугам.ЛицевойСчет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПениПоУслугам.ЛицевойСчет,
	               |	СУММА(ПениПоУслугам.СуммаПениОстаток)
	               |ИЗ
	               |	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Момент, ЛицевойСчет В (&МассивЛС)) КАК ПениПоУслугам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПениПоУслугам.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТСальдоПоЛС.СальдоНаЛС) КАК СальдоНаЛС,
	               |	ВТСальдоПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(ВТСальдоПоЛС.СальдоПениВХ) КАК СальдоПениВХ
	               |ИЗ
	               |	ВТСальдоПоЛС КАК ВТСальдоПоЛС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСальдоПоЛС.ЛицевойСчет";
	
	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("МассивЛС", МассивЛС); 

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьЗаписиСведенияОбОплатеПоДокументу(ДокСсылка, ТаблицаОплат)
	
	Для Каждого СтрокаТаблицы Из ДокСсылка.СписокЛС Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		тзОплатыПоЛицевомуСчету = ТаблицаОплат.Скопировать(ТаблицаОплат.НайтиСтроки(Отбор));
		
		ПериодыНачислений = тзОплатыПоЛицевомуСчету.ВыгрузитьКолонку("ПериодНачисления");
		СуммаОплат = тзОплатыПоЛицевомуСчету.Итог("Сумма");
		
		НаборЗаписей = РегистрыСведений.лб_ДопСведенияОбОплате.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ЛицевойСчет.Установить(СтрокаТаблицы.ЛицевойСчет);
		НаборЗаписей.Отбор.ШаблонКвитанции.Установить(СтрокаТаблицы.ШаблонИзвещений);
		НаборЗаписей.Отбор.Документ.Установить(ДокСсылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ЛицевойСчет      = СтрокаТаблицы.ЛицевойСчет;
		НоваяЗапись.ШаблонКвитанции  = СтрокаТаблицы.ШаблонИзвещений;
		НоваяЗапись.Документ         = ДокСсылка;
		НоваяЗапись.Примечание 		 = "Оплачено: " + Формат(СуммаОплат,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0"); 
		НоваяЗапись.ПериодНачисления = СтрСоединить(ПериодыНачислений, "; ");
		
		НаборЗаписей.Записать();

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
